init.org
#+TITLE: Emacs configuration file
#+AUTHOR: Sean Jones
#+OPTIONS: toc:2
#+BABEL: :cache yes
#+LATEX_HEADER: \usepackage{parskip}
#+LATEX_HEADER: \usepackage{inconsolata}
#+LATEX_HEADER: \usepackage[utf8]{inputenc}
#+PROPERTY: header-args :tangle yes

* About

This configuration is based off of the system shown [[https://github.com/larstvei/dot-emacs][here]]. The idea is
that the configuration should serve as it's own plain english
documentation.

Install with:
#+BEGIN_SRC sh :tangle no
  git clone git@github.com:seandjones92/Emacs.git ~/.emacs.d
#+END_SRC

Once the repo is cloned execute the following commands to prevent the
dynamic configuration from being tracked in git:
#+BEGIN_SRC sh :tangle no
  cd ~/.emacs.d
  git update-index --assume-unchanged init.el
#+END_SRC

If you want to make changes to the repo-version of init.el start tracking again with:
#+BEGIN_SRC sh :tangle no
  git update-index --no-assume-unchanged init.el
#+END_SRC

* Configurations (Internal)
This section contains all of the configurations that do not rely on
external packages. If the configuration cannot be accomplished by a
standalone Emacs installation with no internet connection then it does
not belong here.

** Meta

All changes to the config should be made to =init.org=, *not* to
=init.el=. The running configuration is generated at first launch and
whenever =init.org= is saved from within Emacs. Any changes made
directly to =init.el= will be lost, it is regenerated regularly.

The initial =init.el= looks like this:
#+BEGIN_SRC emacs-lisp :tangle no
  ;; This file replaces itself with the actual configuration at first run.

  ;; We can't tangle without org!
  (require 'org)
  ;; Open the configuration
  (find-file (concat user-emacs-directory "init.org"))
  ;; tangle it
  (org-babel-tangle)
  ;; load it
  (load-file (concat user-emacs-directory "init.el"))
  ;; finally byte-compile it
  (byte-compile-file (concat user-emacs-directory "init.el"))
#+END_SRC

It tangles the org-file, replacing itself with the actual configuration.

To make sure that the encoding prompt is not shown on launch we start
the init with this line:
#+BEGIN_SRC emacs-lisp
  (set-language-environment "UTF-8")
#+END_SRC

The function defined below generates a new =init.el= each time
=init.org= is saved from within Emacs.

#+BEGIN_SRC emacs-lisp
  (defun tangle-init ()
    "If the current buffer is 'init.org' the code-blocks are tangled, and the tangled file is compiled"
    (when (equal (buffer-file-name)
                 (expand-file-name (concat user-emacs-directory "init.org")))
      ;; Avoid running hooks when tangling
      (let ((prog-mode-hook nil))
        (org-babel-tangle)
        (byte-compile-file (concat user-emacs-directory "init.el")))))

  (add-hook 'after-save-hook 'tangle-init)
#+END_SRC

This section will generate =README.md= after each save.
#+BEGIN_SRC emacs-lisp
  (defun generate-init-readme ()
    "If the current buffer is 'init.org' then 'README.md' is generated"
    (when (equal (buffer-file-name)
                 (expand-file-name (concat user-emacs-directory "init.org")))
      ;; Avoid running hooks
      (let ((prog-mode-hook nil))
        (org-md-export-to-markdown)
        (rename-file "init.md" "README.md" t))))

  (add-hook 'after-save-hook 'generate-init-readme)
#+END_SRC

If there is anything that should be kept private (not tracked by git,
and therefore not in this configuration) put it in
=~/.emacs.d/private.el=, it will be loaded if it exists.
#+BEGIN_SRC emacs-lisp
  (add-hook
   'after-init-hook
   (lambda ()
     (let ((private-file (concat user-emacs-directory "private.el")))
       (when (file-exists-p private-file)
         (load-file private-file)))))
#+END_SRC

** Windows
This section is for defining any behavior needed for the configuration
to work properly on Windows. Unfortunately I have to use Windows at
work so these configurations are a must for me.

#+BEGIN_SRC emacs-lisp
  (defun my-windows-config ()
    (setq default-directory (concat "C:\\Users\\" (user-login-name) "\\"))
    (setq python-shell-interpreter "py.exe"))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (if (eq system-type 'windows-nt)
      (my-windows-config))
#+END_SRC

** Base defaults
Here we define the basic look and feel of Emacs.

Remove scrollbars, menu bars, and toolbars:
#+BEGIN_SRC emacs-lisp
  (when (fboundp 'menu-bar-mode) (menu-bar-mode -1))
  (when (fboundp 'tool-bar-mode) (tool-bar-mode -1))
  (when (fboundp 'scroll-bar-mode) (scroll-bar-mode -1))
#+END_SRC

Instead of typeing "yes" or "no" for interactive functions followed by
=<enter>=, all you need to do is press "y" or "n". No =<enter>=
required!
#+BEGIN_SRC emacs-lisp
  (defalias 'yes-or-no-p 'y-or-n-p)
#+END_SRC

Disable the system bell. No flashing, no sounds.
#+BEGIN_SRC emacs-lisp
  (setq ring-bell-function 'ignore)
#+END_SRC

Enable column numbers.
#+BEGIN_SRC emacs-lisp
  (column-number-mode 1)
#+END_SRC

For me this allows for better handling of parenthesis and quotes. As
you type =(= a matching =)= is also created. The same goes for
quotes. It also adds some inteligent handling. Further in the
configuration we use =paredit=, which takes things a step further.
#+BEGIN_SRC emacs-lisp
  (electric-pair-mode 1)
  (require 'paren)
  (setq show-paren-style 'parenthesis)
  (show-paren-mode 1)
#+END_SRC

Enable spell checking.
#+BEGIN_SRC emacs-lisp
  (setq ispell-dictionary "american")
#+END_SRC

Disable word wrapping by default, I don't like it.
#+BEGIN_SRC emacs-lisp
  (set-default 'truncate-lines t)
#+END_SRC

Use =*scratch*= as initial screen. Also, modify the message at the top
of the buffer.
#+BEGIN_SRC emacs-lisp
  (setq inhibit-startup-screen t)
  (setq initial-scratch-message ";; Scratch page\n\n")
#+END_SRC

** Functions
These are my custom functions. I define them all here. If I want them
assigned to a keybinding I do so later in the config.

This function is to be run in =dired=. It prompts for a regular
expression and only shows the entries (files or directories) that
match that regular expression. This is good for working in directories
with lots of files. Think =ls -al | grep -E <expression>=.
#+BEGIN_SRC emacs-lisp
  (defun dired-show-only (regexp)
    "Only show files matching the regexp."
    (interactive "sFiles to show (regexp): ")
    (dired-mark-files-regexp regexp)
    (dired-toggle-marks)
    (dired-do-kill-lines))
#+END_SRC

This function is used to terminate all TRAMP connections and to kill
all buffers associated with TRAMP connections. Sometimes I'll have a
lot going on, machines I'm no longer working on, too many buffers to
sort through and this helps.
#+BEGIN_SRC emacs-lisp
  (defun go-local ()
    "Clean up all remote connections."
    (interactive)
    (ignore-errors (tramp-cleanup-all-connections))
    (ignore-errors (tramp-cleanup-all-buffers)))
#+END_SRC

This, in my opinion, is how Emacs should behave by default when saving
files. Strip all white space from the end of the file and the ends of
lines before saving.
#+BEGIN_SRC emacs-lisp
  (defun save-buffer-clean ()
    "Strip the trailing whitespace from a file and save it."
    (interactive)
    (delete-trailing-whitespace)
    (save-buffer))
#+END_SRC

Again, another function to get what I would like to be default
behavior. This one handles killing buffers. If there is more than one
buffer and I kill one, kill its window too.
#+BEGIN_SRC emacs-lisp
  (defun smart-buffer-kill ()
    "Kill buffers in a way that makes sense."
    (interactive)
    (if (= (count-windows) 1)
        (kill-buffer)
      (kill-buffer-and-window)))
#+END_SRC

This is one I don't use very often but can be useful. Copy the SSH
public key to the clipboard.
#+BEGIN_SRC emacs-lisp
  (defun ssh-clip ()
    "Copy '~/.ssh/id_rsa.pub' to clipboard.
  This will first empty the kill-ring (clipboard)"
    (interactive)
    (if (= (count-windows) 1)
        (let ((origin (current-buffer)))
          (setq kill-ring nil)
          (find-file "~/.ssh/id_rsa.pub")
          (mark-page)
          (kill-ring-save (point-min) (point-max))
          (kill-buffer)
          (message "Public key copied to clipboard"))
      (let ((origin (current-buffer)))
        (setq kill-ring nil)
        (find-file-other-window "~/.ssh/id_rsa.pub")
        (mark-page)
        (kill-ring-save (point-min) (point-max))
        (kill-buffer)
        (switch-to-buffer-other-window origin)
        (message "Public key copied to clipboard"))))
#+END_SRC

** Org Mode

Here is my functional configuration of Org Mode.

Right now, all I really need to change from the default is to enable
more babel languages.
#+BEGIN_SRC emacs-lisp
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((java . t)
     (js . t)
     (sql . t)
     (clojure . t)
     (lisp . t)
     (perl . t)
     (python . t)
     (ruby . t)
     (scheme . t)
     (sh . t)))
#+END_SRC

** Mode hooks
This is where mode hooks are manipulated.
#+BEGIN_SRC emacs-lisp
  (add-hook 'text-mode-hook 'auto-fill-mode)
  (add-hook 'text-mode-hook 'toggle-truncate-lines)
  (add-hook 'org-mode-hook 'turn-on-font-lock)
  (add-hook 'sh-mode-hook 'linum-mode)
  (add-hook 'python-mode-hook 'linum-mode)
#+END_SRC

** Keybindings

This is where I define my custom keybindings.
#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-x C-k") 'smart-buffer-kill)
  (global-set-key (kbd "C-x C-s") 'save-buffer-clean)
  (require 'dired)
  (define-key dired-mode-map [?%?h] 'dired-show-only)
#+END_SRC

Enable keybindings that are disabled by default:
#+BEGIN_SRC emacs-lisp
  (put 'narrow-to-page 'disabled nil)
#+END_SRC

* Configurations (External)
Configurations after this point rely on external packages. Anything
added from here on out should be designed to fail gracefully in case
the package is not available.

