init.el

(set-language-environment "UTF-8")

(defun tangle-init ()
  "If the current buffer is 'init.org' the code-blocks are tangled, and the tangled file is compiled"
  (when (equal (buffer-file-name)
               (expand-file-name (concat user-emacs-directory "init.org")))
    ;; Avoid running hooks when tangling
    (let ((prog-mode-hook nil))
      (org-babel-tangle)
      (byte-compile-file (concat user-emacs-directory "init.el")))))

(add-hook 'after-save-hook 'tangle-init)

(defun generate-init-readme ()
  "If the current buffer is 'init.org' then 'README.md' is generated"
  (when (equal (buffer-file-name)
               (expand-file-name (concat user-emacs-directory "init.org")))
    ;; Avoid running hooks
    (let ((prog-mode-hook nil))
      (org-md-export-to-markdown)
      (rename-file "init.md" "README.md" t))))

(add-hook 'after-save-hook 'generate-init-readme)

(add-hook
 'after-init-hook
 (lambda ()
   (let ((private-file (concat user-emacs-directory "private.el")))
     (when (file-exists-p private-file)
       (load-file private-file)))))

(defun my-windows-config ()
  (setq default-directory (concat "C:\\Users\\" (user-login-name) "\\"))
  (setq python-shell-interpreter "py.exe"))

(if (eq system-type 'windows-nt)
    (my-windows-config))

(when (fboundp 'menu-bar-mode) (menu-bar-mode -1))
(when (fboundp 'tool-bar-mode) (tool-bar-mode -1))
(when (fboundp 'scroll-bar-mode) (scroll-bar-mode -1))

(defalias 'yes-or-no-p 'y-or-n-p)

(setq ring-bell-function 'ignore)

(column-number-mode 1)

(electric-pair-mode 1)
(require 'paren)
(setq show-paren-style 'parenthesis)
(show-paren-mode 1)

(setq ispell-dictionary "american")

(set-default 'truncate-lines t)

(setq inhibit-startup-screen t)
(setq initial-scratch-message ";; Scratch page\n\n")

(defun dired-show-only (regexp)
  "Only show files matching the regexp."
  (interactive "sFiles to show (regexp): ")
  (dired-mark-files-regexp regexp)
  (dired-toggle-marks)
  (dired-do-kill-lines))

(defun go-local ()
  "Clean up all remote connections."
  (interactive)
  (ignore-errors (tramp-cleanup-all-connections))
  (ignore-errors (tramp-cleanup-all-buffers)))

(defun save-buffer-clean ()
  "Strip the trailing whitespace from a file and save it."
  (interactive)
  (delete-trailing-whitespace)
  (save-buffer))

(defun smart-buffer-kill ()
  "Kill buffers in a way that makes sense."
  (interactive)
  (if (= (count-windows) 1)
      (kill-buffer)
    (kill-buffer-and-window)))

(defun ssh-clip ()
  "Copy '~/.ssh/id_rsa.pub' to clipboard.
This will first empty the kill-ring (clipboard)"
  (interactive)
  (if (= (count-windows) 1)
      (let ((origin (current-buffer)))
        (setq kill-ring nil)
        (find-file "~/.ssh/id_rsa.pub")
        (mark-page)
        (kill-ring-save (point-min) (point-max))
        (kill-buffer)
        (message "Public key copied to clipboard"))
    (let ((origin (current-buffer)))
      (setq kill-ring nil)
      (find-file-other-window "~/.ssh/id_rsa.pub")
      (mark-page)
      (kill-ring-save (point-min) (point-max))
      (kill-buffer)
      (switch-to-buffer-other-window origin)
      (message "Public key copied to clipboard"))))

(org-babel-do-load-languages
 'org-babel-load-languages
 '((java . t)
   (js . t)
   (sql . t)
   (clojure . t)
   (lisp . t)
   (perl . t)
   (python . t)
   (ruby . t)
   (scheme . t)
   (sh . t)))

(add-hook 'text-mode-hook 'auto-fill-mode)
(add-hook 'text-mode-hook 'toggle-truncate-lines)
(add-hook 'org-mode-hook 'turn-on-font-lock)
(add-hook 'sh-mode-hook 'linum-mode)
(add-hook 'python-mode-hook 'linum-mode)

(global-set-key (kbd "C-x C-k") 'smart-buffer-kill)
(global-set-key (kbd "C-x C-s") 'save-buffer-clean)
(require 'dired)
(define-key dired-mode-map [?%?h] 'dired-show-only)

(put 'narrow-to-page 'disabled nil)
