init.org
** Packages
This section goes over the configuration of package management. To
start this off we need to define a few things. First we will configure
the repositories we wish to use. The =jorgenschaefer.github.io= repo
is only needed for the Elpy package.
#+BEGIN_SRC emacs-lisp
  (require 'package)
  (setq package-archives '(("gnu" . "https://elpa.gnu.org/packages/")
                           ("melpa" . "https://melpa.org/packages/")
                           ("elpy" . "https://jorgenschaefer.github.io/packages/")))
#+END_SRC

Next we define a function to determine if we have access to the
internet. We need to wrap this in a check for Windows since =ping=
options behave differently.
#+BEGIN_SRC emacs-lisp
  (if (eq system-type 'windows-nt)
      (defun internet-up ()
          (call-process "ping" nil nil nil "-n" "1" "www.google.com"))
    (defun internet-up ()
        (call-process "ping" nil nil nil "-c" "1" "www.google.com")))
#+END_SRC

Next we define a list containing all of the packages that should be
installed to take full advantage of this configuration. The Silver
Searcher should be installed to use the =ag= and =helm-ag= packages.
#+BEGIN_SRC emacs-lisp
  (setq my-packages '(ag
                      all-the-icons
                      auto-complete
                      cider
                      elpy
                      gist
                      helm
                      helm-ag
                      helm-projectile
                      hlinum
                      magit
                      markdown-mode
                      moe-theme
                      multiple-cursors
                      neotree
                      org-bullets
                      paredit
                      projectile
                      powerline
                      zeal-at-point))
#+END_SRC

The next function defined is to loop through the provided list of
packages and to check if they are present. If not, the package is
installed:
#+BEGIN_SRC emacs-lisp
  (defun auto-package-mgmt ()
    "Install my packages"
    (package-initialize)
    (package-refresh-contents)
    (dolist (package my-packages)
      (if (ignore-errors (require package))
          (message "%s is already installed..." package)
        (package-install package))))
#+END_SRC

*TODO:* This should only be automatic the first time emacs is loaded,
it should be interactive from there on out.

To tie it all together we bring in the logic. If we have access to the
internet loop through the list of packages to ensure they are
installed. If we do not have access to the internet nothing is
done. Package dependent configuration is handled gracefully so if
there is no internet there should be no issue.
#+BEGIN_SRC emacs-lisp
  (if (internet-up)
      (auto-package-mgmt))
#+END_SRC

** Auto Complete
Here is where auto complete is configured. The =ac-sources= variable
needs to be set or the completion framework won't kick in.
#+BEGIN_SRC emacs-lisp
  (defun my-autocomplete-setup ()
    (ac-config-default)
    (setq-default ac-sources '(ac-source-filename
                               ac-source-functions
                               ac-source-yasnippet
                               ac-source-variables
                               ac-source-symbols
                               ac-source-features
                               ac-source-abbrev
                               ac-source-words-in-same-mode-buffers
                               ac-source-dictionary)))

  (if (require 'auto-complete-config)
      (my-autocomplete-setup))
#+END_SRC

** Elpy
Elpy is used to get IDE like functionality for Python. To get full use
of this package run =pip install jedi flake8 importmagic autopep8=.

#+BEGIN_SRC emacs-lisp
  (defun my-elpy-keybindings ()
    (define-key elpy-mode-map (kbd "<f12>") 'elpy-goto-definition-other-window))

  (defun my-elpy-setup ()
    (package-initialize)
    (elpy-enable)
    (add-hook 'elpy-mode-hook 'my-elpy-keybindings))

  (if (require 'elpy)
      (my-elpy-setup))
#+END_SRC

** Helm
[[https://github.com/emacs-helm/helm][Helm]] is an Emacs framework for incremental completions and narrowing
selections. It's a much better way to interact with Emacs. I've broken
it out into smaller chunks so I can better explain what's going on.

This section enables fuzzy finding in almost everything Helm
does. This helps to really speed up interaction with emacs since you
can just type a couple partially completed words to get full phrases
instead of spelling everything out.
#+BEGIN_SRC emacs-lisp
  (defun my-helm-fuzzy-settings ()
    (setq helm-M-x-fuzzy-match t
          helm-buffers-fuzzy-matching t
          helm-recentf-fuzzy-match t
          helm-semantic-fuzzy-match t
          helm-imenu-fuzzy-match t
          helm-apropos-fuzzy-match t
          helm-lisp-fuzzy-completion t
          helm-mode-fuzzy-match t
          helm-completion-in-region-fuzzy-match t))
#+END_SRC

This part is where keybindings relevant to Helm are defined. The one
I've found to be most useful is =helm-mini= which is activated with
=C-x x=. This will show you currently open buffers and recent files.
#+BEGIN_SRC emacs-lisp
  (defun my-helm-keybindings ()
    (global-set-key (kbd "C-c h") 'helm-command-prefix)
    (global-unset-key (kbd "C-x c"))
    (global-set-key (kbd "M-x") 'helm-M-x)
    (global-set-key (kbd "M-y") 'helm-show-kill-ring)
    (global-set-key (kbd "C-x x") 'helm-mini)
    (global-set-key (kbd "C-x C-f") 'helm-find-files)
    (global-set-key (kbd "C-c h o") 'helm-occur)
    (global-set-key (kbd "C-x C-b") 'helm-buffers-list)
    (define-key helm-map (kbd "<tab>") 'helm-execute-persistent-action)
    (define-key helm-map (kbd "C-i") 'helm-execute-persistent-action)
    (define-key helm-map (kbd "C-z") 'helm-select-action))
#+END_SRC

This section has some more miscellaneous settings. In all honesty I
need to research them a bit more to accuratly describe what each of
these does.
#+BEGIN_SRC emacs-lisp
  (defun my-helm-misc ()
    (add-to-list 'helm-sources-using-default-as-input 'helm-source-man-pages)

    (when (executable-find "curl")
      (setq helm-net-prefer-curl t))

    (when (executable-find "ack-grep")
      (setq helm-grep-default-command "ack-grep -Hn --no-group --no-color %e %p %f"
            helm-grep-default-recurse-command "ack-grep -H --no-group --no-color %e %p %f"))

    (setq helm-split-window-inside-p t
          helm-move-to-line-cycle-in-source t
          helm-ff-search-library-in-sexp t
          helm-scroll-amount 8
          helm-ff-file-name-history-recentf t))
#+END_SRC

This section tells the Helm interface that it should resize itself
depending on how much content it has to display, but should take up no
more than 65 percent of the Emacs interface.
#+BEGIN_SRC emacs-lisp
  (defun my-helm-sizing ()
    (helm-autoresize-mode 1)
    (setq helm-autoresize-max-height 65))
#+END_SRC

Next we tie all of these pieces together in a setup function. It is
important to have the =(require 'helm-config)= on top or else the
configuration will fail.
#+BEGIN_SRC emacs-lisp
  (defun my-helm-setup ()
    (require 'helm-config)
    (my-helm-fuzzy-settings)
    (my-helm-keybindings)
    (my-helm-misc)
    (my-helm-sizing)
    (helm-mode 1))
#+END_SRC

Finally we will check to see if Helm is available before applying any
of these settings.
#+BEGIN_SRC emacs-lisp
  (if (require 'helm)
      (my-helm-setup))
#+END_SRC

** Magit
Magit is something that, in my opinion, should be shipped by default
with Emacs. It's the most robust Git interface out there.
#+BEGIN_SRC emacs-lisp
  (defun my-magit-setup ()
    (global-set-key (kbd "C-x g") 'magit-status)
    (global-set-key (kbd "C-x M-g") 'magit-dispatch-popup))

  (if (require 'magit)
      (my-magit-setup))
#+END_SRC

** Multiple cursors

#+BEGIN_SRC emacs-lisp
  (defun my-multicursor-setup ()
    (global-set-key (kbd "C-S-c C-S-c") 'mc/edit-lines)
    (global-set-key (kbd "C->") 'mc/mark-next-like-this)
    (global-set-key (kbd "C-<") 'mc/mark-previous-like-this)
    (global-set-key (kbd "C-c C-<") 'mc/mark-all-like-this))

  (if (require 'multiple-cursors)
      (my-multicursor-setup))
#+END_SRC

** Paredit
This is for better handling of S-expressions in lisp languages
#+BEGIN_SRC emacs-lisp
  (autoload 'enable-paredit-mode "paredit" "Turn on pseudo-structural editing of Lisp code." t)
  (add-hook 'emacs-lisp-mode-hook       #'enable-paredit-mode)
  (add-hook 'eval-expression-minibuffer-setup-hook #'enable-paredit-mode)
  (add-hook 'ielm-mode-hook             #'enable-paredit-mode)
  (add-hook 'lisp-mode-hook             #'enable-paredit-mode)
  (add-hook 'lisp-interaction-mode-hook #'enable-paredit-mode)
  (add-hook 'scheme-mode-hook           #'enable-paredit-mode)
  (add-hook 'eshell-mode-hook           #'enable-paredit-mode)
  (add-hook 'clojure-mode-hook          #'enable-paredit-mode)
  (add-hook 'cider-repl-mode            #'enable-paredit-mode)
#+END_SRC

** Projectile

#+BEGIN_SRC emacs-lisp
  (defun my-projectile-keybindings ()
    (define-key projectile-mode-map (kbd "C-c a") 'helm-projectile-ag))

  (defun my-projectile-setup ()
    (projectile-mode)
    (projectile-discover-projects-in-directory default-directory)
    (add-hook 'projectile-mode-hook 'my-projectile-keybindings))

  (if (require 'projectile)
      (my-projectile-setup))
#+END_SRC

** Highlight line number

#+BEGIN_SRC emacs-lisp
  (if (require 'hlinum)
      (hlinum-activate))
#+END_SRC

