init.el

(require 'package)
(setq package-archives '(("gnu" . "https://elpa.gnu.org/packages/")
                         ("melpa" . "https://melpa.org/packages/")
                         ("elpy" . "https://jorgenschaefer.github.io/packages/")))

(if (eq system-type 'windows-nt)
    (defun internet-up ()
        (call-process "ping" nil nil nil "-n" "1" "www.google.com"))
  (defun internet-up ()
      (call-process "ping" nil nil nil "-c" "1" "www.google.com")))

(setq my-packages '(ag
                    all-the-icons
                    auto-complete
                    cider
                    elpy
                    gist
                    helm
                    helm-ag
                    helm-projectile
                    hlinum
                    magit
                    markdown-mode
                    moe-theme
                    multiple-cursors
                    neotree
                    org-bullets
                    paredit
                    projectile
                    powerline
                    zeal-at-point))

(defun auto-package-mgmt ()
  "Install my packages"
  (package-initialize)
  (package-refresh-contents)
  (dolist (package my-packages)
    (if (ignore-errors (require package))
        (message "%s is already installed..." package)
      (package-install package))))

(if (internet-up)
    (auto-package-mgmt))

(defun my-autocomplete-setup ()
  (ac-config-default)
  (setq-default ac-sources '(ac-source-filename
                             ac-source-functions
                             ac-source-yasnippet
                             ac-source-variables
                             ac-source-symbols
                             ac-source-features
                             ac-source-abbrev
                             ac-source-words-in-same-mode-buffers
                             ac-source-dictionary)))

(if (require 'auto-complete-config)
    (my-autocomplete-setup))

(defun my-elpy-keybindings ()
  (define-key elpy-mode-map (kbd "<f12>") 'elpy-goto-definition-other-window))

(defun my-elpy-setup ()
  (package-initialize)
  (elpy-enable)
  (add-hook 'elpy-mode-hook 'my-elpy-keybindings))

(if (require 'elpy)
    (my-elpy-setup))

(defun my-helm-fuzzy-settings ()
  (setq helm-M-x-fuzzy-match t
        helm-buffers-fuzzy-matching t
        helm-recentf-fuzzy-match t
        helm-semantic-fuzzy-match t
        helm-imenu-fuzzy-match t
        helm-apropos-fuzzy-match t
        helm-lisp-fuzzy-completion t
        helm-mode-fuzzy-match t
        helm-completion-in-region-fuzzy-match t))

(defun my-helm-keybindings ()
  (global-set-key (kbd "C-c h") 'helm-command-prefix)
  (global-unset-key (kbd "C-x c"))
  (global-set-key (kbd "M-x") 'helm-M-x)
  (global-set-key (kbd "M-y") 'helm-show-kill-ring)
  (global-set-key (kbd "C-x x") 'helm-mini)
  (global-set-key (kbd "C-x C-f") 'helm-find-files)
  (global-set-key (kbd "C-c h o") 'helm-occur)
  (global-set-key (kbd "C-x C-b") 'helm-buffers-list)
  (define-key helm-map (kbd "<tab>") 'helm-execute-persistent-action)
  (define-key helm-map (kbd "C-i") 'helm-execute-persistent-action)
  (define-key helm-map (kbd "C-z") 'helm-select-action))

(defun my-helm-misc ()
  (add-to-list 'helm-sources-using-default-as-input 'helm-source-man-pages)

  (when (executable-find "curl")
    (setq helm-net-prefer-curl t))

  (when (executable-find "ack-grep")
    (setq helm-grep-default-command "ack-grep -Hn --no-group --no-color %e %p %f"
          helm-grep-default-recurse-command "ack-grep -H --no-group --no-color %e %p %f"))

  (setq helm-split-window-inside-p t
        helm-move-to-line-cycle-in-source t
        helm-ff-search-library-in-sexp t
        helm-scroll-amount 8
        helm-ff-file-name-history-recentf t))

(defun my-helm-sizing ()
  (helm-autoresize-mode 1)
  (setq helm-autoresize-max-height 65))

(defun my-helm-setup ()
  (require 'helm-config)
  (my-helm-fuzzy-settings)
  (my-helm-keybindings)
  (my-helm-misc)
  (my-helm-sizing)
  (helm-mode 1))

(if (require 'helm)
    (my-helm-setup))

(defun my-magit-setup ()
  (global-set-key (kbd "C-x g") 'magit-status)
  (global-set-key (kbd "C-x M-g") 'magit-dispatch-popup))

(if (require 'magit)
    (my-magit-setup))

(defun my-multicursor-setup ()
  (global-set-key (kbd "C-S-c C-S-c") 'mc/edit-lines)
  (global-set-key (kbd "C->") 'mc/mark-next-like-this)
  (global-set-key (kbd "C-<") 'mc/mark-previous-like-this)
  (global-set-key (kbd "C-c C-<") 'mc/mark-all-like-this))

(if (require 'multiple-cursors)
    (my-multicursor-setup))

(autoload 'enable-paredit-mode "paredit" "Turn on pseudo-structural editing of Lisp code." t)
(add-hook 'emacs-lisp-mode-hook       #'enable-paredit-mode)
(add-hook 'eval-expression-minibuffer-setup-hook #'enable-paredit-mode)
(add-hook 'ielm-mode-hook             #'enable-paredit-mode)
(add-hook 'lisp-mode-hook             #'enable-paredit-mode)
(add-hook 'lisp-interaction-mode-hook #'enable-paredit-mode)
(add-hook 'scheme-mode-hook           #'enable-paredit-mode)
(add-hook 'eshell-mode-hook           #'enable-paredit-mode)
(add-hook 'clojure-mode-hook          #'enable-paredit-mode)
(add-hook 'cider-repl-mode            #'enable-paredit-mode)

(defun my-projectile-keybindings ()
  (define-key projectile-mode-map (kbd "C-c a") 'helm-projectile-ag))

(defun my-projectile-setup ()
  (projectile-mode)
  (projectile-discover-projects-in-directory default-directory)
  (add-hook 'projectile-mode-hook 'my-projectile-keybindings))

(if (require 'projectile)
    (my-projectile-setup))

(if (require 'hlinum)
    (hlinum-activate))
