init.org
** Neotree
In order for this to look right the fonts for =all-the-icons= must be
installed. This is accomplished by =M-x all-the-icons-install-fonts=.
#+BEGIN_SRC emacs-lisp
  (defun neotree-project-dir ()
    "Open NeoTree using the git root."
    (interactive)
    (let ((project-dir (projectile-project-root))
          (file-name (buffer-file-name)))
      (neotree-toggle)
      (if project-dir
          (if (neo-global--window-exists-p)
              (progn
                (neotree-dir project-dir)
                (neotree-find file-name)))
        (message "Could not find git project root."))))

  (defun my-neotree-setup ()
    (global-set-key (kbd "C-c n") 'neotree-project-dir)
    (if (eq system-type 'windows-nt)
        (setq neo-theme 'arrow)
      (setq neo-theme 'icons))
    (setq projectile-switch-project-action 'neotree-projectile-action)
    (setq neo-window-width 30))

  (if (require 'neotree)
      (my-neotree-setup))
#+END_SRC

** Themeing

#+BEGIN_SRC emacs-lisp
  (defun my-moetheme-setup ()
    (setq moe-theme-highlight-buffer-id t)
    (setq moe-theme-resize-markdown-title '(2.0 1.7 1.5 1.3 1.0 1.0))
    (setq moe-theme-resize-org-title '(2.2 1.8 1.6 1.4 1.2 1.0 1.0 1.0 1.0))
    (moe-dark))

  (defun my-moetheme-with-powerline ()
    (powerline-moe-theme)
    (setq moe-theme-highlight-buffer-id t)
    (setq moe-theme-resize-markdown-title '(2.0 1.7 1.5 1.3 1.0 1.0))
    (setq moe-theme-resize-org-title '(2.0 1.7 1.5 1.3 1.0 1.0 1.0 1.0 1.0))
    (moe-dark)
    (setq powerline-default-separator 'wave))

  (if (require 'powerline)
      (if (require 'moe-theme)
          (my-moetheme-with-powerline))
    (if (require 'moe-theme)
        (my-moetheme-setup)))

  (if (require 'org-bullets)
      (add-hook 'org-mode-hook
                (lambda ()
                  (org-bullets-mode 1))))
#+END_SRC

** Zeal

Offline documentation. Make sure [[https://zealdocs.org/][Zeal]] is installed first.
#+BEGIN_SRC emacs-lisp
  (global-set-key "\C-cd" 'zeal-at-point)
#+END_SRC

If you are on Windows you need to add Zeal to the exec path.
#+BEGIN_SRC emacs-lisp
  (if (eq system-type 'windows-nt)
      (add-to-list 'exec-path "C:/Program Files/Zeal"))
#+END_SRC

* Systemd unit file
Here is an example of a unit file for the emacs daemon. Place this in
=~/.config/systemd/user/emacs.service=.

#+BEGIN_SRC sh :tangle no
  [Unit]
  Description=Emacs: the extensible, self-documenting text editor

  [Service]
  Type=forking
  ExecStart=/usr/bin/emacs --daemon
  ExecStop=/usr/bin/emacsclient --eval "(kill-emacs)"
  Environment=SSH_AUTH_DOCK=%t/keyring/ssh
  Restart=always

  [Install]
  WantedBy=default.target
#+END_SRC

Once this is created run =systemctl enable --user emacs.service= to
enable the daemon, and =systemctl start --user emacs.service=

* Licensing
© Copyright 2016 Sean Jones

This program is free software: you can redistribute it and/or modify
it under the terms of the GNU General Public License as published by
the Free Software Foundation, either version 3 of the License, or
(at your option) any later version.

This program is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
GNU General Public License for more details.

You should have received a copy of the GNU General Public License
along with this program.  If not, see <http://www.gnu.org/licenses/>.
