init.el

(defun neotree-project-dir ()
  "Open NeoTree using the git root."
  (interactive)
  (let ((project-dir (projectile-project-root))
        (file-name (buffer-file-name)))
    (neotree-toggle)
    (if project-dir
        (if (neo-global--window-exists-p)
            (progn
              (neotree-dir project-dir)
              (neotree-find file-name)))
      (message "Could not find git project root."))))

(defun my-neotree-setup ()
  (global-set-key (kbd "C-c n") 'neotree-project-dir)
  (if (eq system-type 'windows-nt)
      (setq neo-theme 'arrow)
    (setq neo-theme 'icons))
  (setq projectile-switch-project-action 'neotree-projectile-action)
  (setq neo-window-width 30))

(if (require 'neotree)
    (my-neotree-setup))

(defun my-moetheme-setup ()
  (setq moe-theme-highlight-buffer-id t)
  (setq moe-theme-resize-markdown-title '(2.0 1.7 1.5 1.3 1.0 1.0))
  (setq moe-theme-resize-org-title '(2.2 1.8 1.6 1.4 1.2 1.0 1.0 1.0 1.0))
  (moe-dark))

(defun my-moetheme-with-powerline ()
  (powerline-moe-theme)
  (setq moe-theme-highlight-buffer-id t)
  (setq moe-theme-resize-markdown-title '(2.0 1.7 1.5 1.3 1.0 1.0))
  (setq moe-theme-resize-org-title '(2.0 1.7 1.5 1.3 1.0 1.0 1.0 1.0 1.0))
  (moe-dark)
  (setq powerline-default-separator 'wave))

(if (require 'powerline)
    (if (require 'moe-theme)
        (my-moetheme-with-powerline))
  (if (require 'moe-theme)
      (my-moetheme-setup)))

(if (require 'org-bullets)
    (add-hook 'org-mode-hook
              (lambda ()
                (org-bullets-mode 1))))

(global-set-key "\C-cd" 'zeal-at-point)

(if (eq system-type 'windows-nt)
    (add-to-list 'exec-path "C:/Program Files/Zeal"))
